<?php

$access_token = 'QkERSr95E8xPvTP40mlaIZsY7hBwDKusWmPcp3jChPSxaUF/KNcs8RaVJiThluW6fAHh8jE4vnvsKiHxNnggvcbOtmYk0WHE4FgeNIavK/7F9ypKAHliyjFoK/xlhDHlpy5DJy5rUCKiGgQOVdGbYgdB04t89/1O/w1cDnyilFU=';

// Get POST body content
$content = file_get_contents('php://input');
// Parse JSON
$events = json_decode($content, true);
// Validate parsed JSON data
if (!is_null($events['events'])) {
	// Loop through each event
	foreach ($events['events'] as $event) {
		// Reply only when message sent is in 'text' format
		if ($event['type'] == 'message' && $event['message']['type'] == 'text') {
			// Get text sent
			$text = $event['message']['text'];
			// Get replyToken
			$replyToken = $event['replyToken'];

			// Build message to reply back
			//if($text == 'ก้อง' || $text == 'ชาติ'|| $text == 'อั้ม'|| $text == 'ลุง'){
			//	$messages = [
			//	'type' => 'text',
			//	'text' => กาก
			//];}
			
			if($text == 'v' || $text == 'v ' || $text == 'V' || $text == 'V ' || $text == 'view' || $text == 'view ' || $text == 'View' || $text == 'View ' || $text == '.'){
				$messages = [
				'type' => 'text',
				'text' => viewlastseen
			];}
			
			if($text == 's' || $text == 's ' || $text == 'S' || $text == 'S ' || $text == 'set' || $text == 'set ' || $text == 'Set' || $text == 'Set ' || $text == '..'){
				$messages = [
				'type' => 'text',
				'text' => setlastpoint
			];}		
			
			if(strstr($text,'have seen at the lastseen point')){
				sleep(3);
				$messages = [
				'type' => 'text',
				'text' => setlastpoint
			];}
			
			$array = array("\n\t\nHi", "\n\t\nHello", "\n\t\nสวัสดีประเทศไทย", "\n\t\nพักแป๊ป", "\n\t\nพักแพร๊บ", "\n\t\nจ๊ะเอ๋", "\n\t\nสวัสดี", "\n\t\nสวัสดีครับ", "\n\t\nสวัสดีค่ะ", "\n\t\nสวัสดีจ้า", "\n\t\nสวีดัส สวัสดี", "\n\t\nสวัสดีจ๊ะ", "\n\t\nกาก", "\n\t\nมะกรูด", "\n\t\nแอแฮร่", "\n\t\nมาคุยกัน", "\n\t\nออกมานะ", "\n\t\nจับได้แล้ว", "\n\t\nมีแป้นพิมพ์ไหม", "\n\t\nคุยได้ไม่กัด แต่จะกัด ถ้าไม่คุย", "\n\t\nคนพิมพ์น่ารัก", "\n\t\nคนอ่านน่ารัก", "\n\t\nที่นี่ที่ไหน", "\n\t\nกลุ่มหรือป่าช้า", "\n\t\nขอพักบ้างนะ อย่าใช้งานเยอะ", "\n\t\nสนุกมากไหม มาลองทำเองดูสิ");
			$output = $array[array_rand($array,1)];
		
			if(strstr($text,'Set the lastseens')){
				$messages = [
				'type' => 'text',
				'text' => $output
			];}
			
			if(strstr($text,'บอทกาก')){
			$messages = [
				'type' => 'text',
				'text' => ใครกันแน่ที่กาก
			];}
			
			$arrayyyy = array('เรียนมาน้อยสินะ เลยพิมพ์ได้แค่คำว่า กาก', 'ปมด้อยสินะ ถึงว่าคนอื่นกาก', 'ว่าคนอื่นกาก ก็กากเหมือนกันแหละว้า', 'กาก กาก กาก กาก กาก กาก กาก กาก กาก พอใจม่ะ', 'อย่าหาว่าสอนเลยนะ คำว่า กาก เค้าไว้ใช้เรียกคุณนั่นแหละ', 'ไม่ได้ไปกากบนหัวคุณสักหน่อย', 'พิมพ์คำอื่นไม่เป็นหรือไง', 'กากแล้วไง ไปยุ่งกับเค้าทำไม', 'ใครกันแน่ที่กาก', 'มั่นใจว่ากาก', 'กากแล้วทำไม', 'พ่อแม่ไม่รักสินะ ถึงว่าคนอื่น', 'กาก แล้วไง', 'มีปัญหาป่ะ', 'กาก ก๊าก กาก', 'กากจริง ๆ', 'เดินไปส่องกระจกสิ จะเจอกากกว่า', 'กาก', 'กอ อา กอ กาก', 'ขอบคุณ');
			$outputttt = $arrayyyy[array_rand($arrayyyy,1)];
			
			if(strstr($text,'กาก')){
			$messages = [
				'type' => 'text',
				'text' => $outputttt
			];}
			
			if($text == '...'){
				$messages = [
				'type' => 'text',
				'text' => จุดจุดจุด
			];}		
			
			if(strstr($text,'กลุ่มอะไร')){
				$messages = [
				'type' => 'text',
				'text' => กลุ่มส่งใบโคลเวอร์เกมเศรษฐีครับ
			];}	
				
			if(strstr($text,'ห้องอะไร')){
				$messages = [
				'type' => 'text',
				'text' => ห้องส่งใบโคลเวอร์เกมเศรษฐีครับ
			];}	
			
			$arrayy = array('สวัสดีครับ', 'สวัสดีค่ะ', 'ดีครับ', 'ดีค่ะ', 'ดีคับ', 'หวัดดีคับ', 'หวัดดีครับ', 'หวัดดีค่ะ');
			$outputt = $arrayy[array_rand($arrayy,1)];
		
			if($text == 'สวัสดี' || $text == 'สวัสดีครับ' || $text == 'ดีครับ' || $text == 'ดีคับ' || $text == 'สวัสดีค่ะ' || $text == 'ดีค่ะ' || $text == 'หวัดดีคับ' || $text == 'หวัดดีครับ' || $text == 'หวัดดีค่ะ'){
				$messages = [
				'type' => 'text',
				'text' => $outputt
			];}		
			
			$arrayyy = array('ฝันดีครับ', 'ฝันดีค่ะ', 'นอนหลับฝันดีนะ', 'Sweet dreams.', 'Good Night', 'GN', 'ฝันดีผีกัดตูด', 'ราตรีสวัสดิ์', 'นอนหลับฝันดี ฝันถึงเราด้วยนะ');
			$outputtt = $arrayyy[array_rand($arrayyy,1)];
		
			if($text == 'ราตรีสวัสดิ์' || $text == 'ฝันดี' || $text == 'ง่วงล่ะ' || $text == 'ง่วงแล้ว' || $text == 'นอนกันเถอะ' || $text == 'นอนก่อนนะ' || $text == 'ขอตัวนอนก่อนนะ' || $text == 'ขอตัวนอนก่อน' || $text == 'นอนกันดีกว่า' || $text == 'นอนดีกว่า' || $text == 'พรุ่งนี้ตื่นเช้า' || $text == 'ฝันดีครับ' || $text == 'ฝันดีคับ' || $text == 'ฝันดีค่ะ' || $text == 'นอนหลับฝันดี' || $text == 'นอนแล้วนะ' || $text == 'นอนดีกว่า' || $text == 'นอนก่อนนะ' || $text == 'ขอตัวนอนก่อนนะ' || $text == 'ฝันดีทุกคน' || $text == 'ฝันดี ทุกคน' || $text == 'นอนแล้วครับ' || $text == 'นอนแล้วคับ'){
				$messages = [
				'type' => 'text',
				'text' => $outputtt
			];}	
			
			if(strstr($text,'ฝันดี')){
				$messages = [
				'type' => 'text',
				'text' => ฝันดี
			];}
			
			if(strstr($text,'ดีคับ')){
				$messages = [
				'type' => 'text',
				'text' => สวัสดีครับ
			];}
					
			if(strstr($text,'ดีครับ')){
				$messages = [
				'type' => 'text',
				'text' => สวัสดีครับ
			];}
			
			if(strstr($text,'ดีค่ะ')){
				$messages = [
				'type' => 'text',
				'text' => สวัสดีค่ะ
			];}
			
			if($text == 'NaN'){
				$messages = [
				'type' => 'text',
				'text' => ".\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n."
			];}	
				
			if($text == 'RUN'){
				$messages = [
				'type' => 'text',
				'text' => "09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.0"
			];}	

			if(strstr($text,'กฎเทส')){
				$messages = [
				'type' => 'text',
				'text' => "กฎในการทดสอบก่อนเข้าแคลน (ปรับปรุง 02/11/59) \n\t\n 1. ไม่อยู่ในสังกัดของแคลนใด ๆ ขณะทำการทดสอบ หากทราบจะทำการแบนทันที \n\t\n 2. จะต้องมีการ์ดตัวละคร S+ LV. 30 คุมเต๋า 83 ขึ้นไป และมีจี้ที่จำเป็นสำหรับสายวิคเตอรี่และสายล้มละลาย เทียบเท่า S+ LV. 7 ขึ้นไป พร้อมความสามารถพิเศษของจี้เครื่องราง S+ ที่เหมาะสม (อาจมีการเปลี่ยนแปลงตามความเหมาะสม ขึ้นอยู่กับผู้ทำทดสอบ) ถ้าจี้ S+ LV. 7 ยังไม่ครบ 4 ชิ้นขึ้นไป จะยังไม่ส่งลงแข่งในรายการต่าง ๆ \n\t\n 3. จะทำการทดสอบด้วยแผนที่ 'ประเทศไทย' 2 ครั้ง \n โดยจะเป็นการทดสอบแบบเดี่ยว 1 ครั้ง และแบบทีม 1 ครั้ง ต้องชนะอย่างน้อย 1 ครั้ง จึงจะสามารถผ่านเข้าแคลนได้ อนุโลมได้ถ้าผู้ทำการทดสอบเห็นว่ามีศักยภาพมากพอในการเข้าร่วมกับแคลนได้ \n\t\n * การทดสอบแบบทีมให้ผู้ที่มาขอเข้าทดสอบเล่นคู่กับผู้ทำการทดสอบ แล้วไปสุ่มหาคู่แข่งในห้อง 10 M \n * การทดสอบอาจมีการเปลี่ยนแปลงตามความเหมาะสม ขึ้นอยู่กับผู้ทำการทดสอบ \n\t\n 4. หากทดสอบแล้ว 'ผ่าน' ให้ผู้มาขอเข้าทดสอบเปลี่ยนชื่อในไลน์เป็น (OMG)-ชื่อ-ตัวเลข ส่วนในเกมให้เปลี่ยนเป็น (OMG)-ตัวเลข เช่น ชื่อในไลน์เป็น (OMG)-ABC-00 ในเกมส์จะเป็น (OMG)-00 ชื่อในเกมสามารถเปลี่ยนทีหลังได้ หากไม่มีเพชรเปลี่ยน แต่ต้องเปลี่ยนภายใน 24 ชม. หลังจากทราบว่า 'ผ่าน' แล้ว  \n\t\n *ตัวเลขที่ต้องใส่ผู้ทำการทดสอบจะเป็นคนแจ้งให้ทราบ \n\t\n 5. เมื่อดึงเข้าแคลนแล้ว ให้แนะนำตัว (ชื่อ อายุ) และอ่านโน๊ตทุกโน๊ตที่ถูกโพสต์ในหน้าโน๊ตของห้องแคลน \n\t\n 6. ต้องมีเวลาว่างช่วงเวลา 17.00 - 22.30 น. ตรงต่อเวลา และเข้ามาคุยในแคลนเป็นประจำ \n\t\n 7. ปฏิบัติตามกฎของแคลนได้ทุกข้อ สามารถอ่านได้ที่โน๊ตของกลุ่ม \n\t\n *** ไม่สะดวกข้อไหนกรุณาแจ้งล่วงหน้า มิฉะนั้นหากเข้าแคลนแล้ว อาจโดนให้ออกจากแคลน โดยไม่แจ้งให้ทราบล่วงหน้า \n"
			];}
			
			
			//if(strstr($text,'Set the lastseens')){
			//	$messages = [
			//	'type' => 'sticker',
			//	'STKID' => '100',
			//	'STKPKGID' => '1',
			//	'STKVER' => '100'
			//];}
			
			//else{$messages = [
			//'type' => 'text',
			//'text' => $text}

			// Make a POST Request to Messaging API to reply to sender
			$url = 'https://api.line.me/v2/bot/message/reply';
			$data = [
				'replyToken' => $replyToken,
				'messages' => [$messages],
			];
			$post = json_encode($data);
			$headers = array('Content-Type: application/json', 'Authorization: Bearer ' . $access_token);

			$ch = curl_init($url);
			curl_setopt($ch, CURLOPT_CUSTOMREQUEST, "POST");
			curl_setopt($ch, CURLOPT_RETURNTRANSFER, true);
			curl_setopt($ch, CURLOPT_POSTFIELDS, $post);
			curl_setopt($ch, CURLOPT_HTTPHEADER, $headers);
			curl_setopt($ch, CURLOPT_FOLLOWLOCATION, 1);
			$result = curl_exec($ch);
			curl_close($ch);

			echo $result . "\r\n";
		}
		elseif ($event['type'] == 'message' && $event['message']['type'] == 'sticker') {

			// Get replyToken
			$replyToken = $event['replyToken'];
					
			//$sticker = array(
			//'type' => 'sticker',
			//'STKID' => '100',
			//'STKPKGID' => '1',
			//'STKVER' => '100'
			//);
			
			//$sticker = [
			//	'type' => 'text',
			//	'text' => ว๊ายขี้อวด
			//];
			
			$sticker = [
			‘type’ => ‘sticker’,
			‘packageId’ => ‘4’,
			‘stickerId’ => ‘300’
			];
			
			//$sticker = array(
			//‘type’ => ‘sticker’,
			//‘packageId’ => ‘4’,
			//‘stickerId’ => ‘300’
			//);
			
			// Make a POST Request to Messaging API to reply to sender
			$url = 'https://api.line.me/v2/bot/message/reply';
			$packet = [
				'replyToken' => $replyToken,
				'messages' =>[$sticker],
			];
			
			$post = json_encode($packet);
			$headers = array('Content-Type: application/json', 'Authorization: Bearer ' . $access_token);

			$ch = curl_init($url);
			curl_setopt($ch, CURLOPT_CUSTOMREQUEST, "POST");
			curl_setopt($ch, CURLOPT_RETURNTRANSFER, true);
			curl_setopt($ch, CURLOPT_POSTFIELDS, $post);
			curl_setopt($ch, CURLOPT_HTTPHEADER, $headers);
			curl_setopt($ch, CURLOPT_FOLLOWLOCATION, 1);
			$result = curl_exec($ch);
			curl_close($ch);

			echo $result . "\r\n";
		}
	}
}

echo "OK";