<?php

$access_token = 'QkERSr95E8xPvTP40mlaIZsY7hBwDKusWmPcp3jChPSxaUF/KNcs8RaVJiThluW6fAHh8jE4vnvsKiHxNnggvcbOtmYk0WHE4FgeNIavK/7F9ypKAHliyjFoK/xlhDHlpy5DJy5rUCKiGgQOVdGbYgdB04t89/1O/w1cDnyilFU=';
// userid = Ua132ce2b9afeaa52b171291470a85697
// Channel Secret = 21cd081db2eb84679640ba07b553235c
// Channel ID = 1488022463
// Get POST body content
$content = file_get_contents('php://input');
// Parse JSON
$events = json_decode($content, true);
// Validate parsed JSON data
if (!is_null($events['events'])) {
	// Loop through each event
	foreach ($events['events'] as $event) {
		// Reply only when message sent is in 'text' format
		if ($event['type'] == 'message' && $event['message']['type'] == 'text') {
			// Get text sent
			$text = $event['message']['text'];
			// Get replyToken
			$replyToken = $event['replyToken'];

			// Build message to reply back
			//if($text == 'ก้อง' || $text == 'ชาติ'|| $text == 'อั้ม'|| $text == 'ลุง'){
			//	$messages = [
			//	'type' => 'text',
			//	'text' => กาก
			//];}
			
			if($text == 'v' || $text == 'v ' || $text == 'V' || $text == 'V ' || $text == 'view' || $text == 'view ' || $text == 'View' || $text == 'View ' || $text == '.'){
				$messages = [
				'type' => 'text',
				'text' => viewlastseen
			];}
			
			if($text == 's' || $text == 's ' || $text == 'S' || $text == 'S ' || $text == 'set' || $text == 'set ' || $text == 'Set' || $text == 'Set ' || $text == '..'){
				$messages = [
				'type' => 'text',
				'text' => setlastpoint
			];}		
			
			if(strstr($text,'have seen at the lastseen point')){
				sleep(3);
				$messages = [
				'type' => 'text',
				'text' => setlastpoint
			];}
			
			$array = array("\n\t\nHi", "\n\t\nHello", "\n\t\nสวัสดีประเทศไทย", "\n\t\nพักแป๊ป", "\n\t\nพักแพร๊บ", "\n\t\nจ๊ะเอ๋", "\n\t\nสวัสดี", "\n\t\nสวัสดีครับ", "\n\t\nสวัสดีค่ะ", "\n\t\nสวัสดีจ้า", "\n\t\nสวีดัส สวัสดี", "\n\t\nสวัสดีจ๊ะ", "\n\t\nกาก", "\n\t\nมะกรูด", "\n\t\nแอแฮร่", "\n\t\nมาคุยกัน", "\n\t\nออกมานะ", "\n\t\nจับได้แล้ว", "\n\t\nมีแป้นพิมพ์ไหม", "\n\t\nคุยได้ไม่กัด แต่จะกัด ถ้าไม่คุย", "\n\t\nคนพิมพ์น่ารัก", "\n\t\nคนอ่านน่ารัก", "\n\t\nที่นี่ที่ไหน", "\n\t\nกลุ่มหรือป่าช้า", "\n\t\nขอพักบ้างนะ อย่าใช้งานเยอะ", "\n\t\nสนุกมากไหม มาลองทำเองดูสิ");
			$output = $array[array_rand($array,1)];
		
			if(strstr($text,'Set the lastseens')){
				$messages = [
				'type' => 'text',
				'text' => $output
			];}
			
			$arraybot = array('', '', '', '', '', '', '', '', '', '', '', '', '', 'จ๋าจ๊ะ', 'ว่าไงจ๊ะ', 'คิดถึงล่ะซี้', 'เรียกทำไมจ๊ะ', 'ด่าได้ แต่อย่าแรง', 'ชื่อเหมือนบิดาคุณหรอ', 'บอทไงจ๊ะ จะใครล่ะ', 'ครับผม จะรีบไปไหน จะรีบไปไหน พักเดี๋ยวหนึ่งซิครับ', '', '', '', '', '', '', '', '', '', '', '', '');
			$outputbot = $arraybot[array_rand($arraybot,1)];
			
			if(strstr($text,'บอท')){
				$messages = [
				'type' => 'text',
				'text' => $outputbot
			];}
			
			$arrayyyy = array('เรียนมาน้อยสินะ เลยพิมพ์ได้แค่คำว่า กาก', 'ปมด้อยสินะ ถึงว่าคนอื่นกาก', 'ว่าคนอื่นกาก ก็กากเหมือนกันแหละว้า', 'กาก กาก กาก กาก กาก กาก กาก กาก กาก พอใจม่ะ', 'อย่าหาว่าสอนเลยนะ คำว่า กาก เค้าไว้ใช้เรียกคุณนั่นแหละ', 'ไม่ได้ไปกากบนหัวคุณสักหน่อย', 'พิมพ์คำอื่นไม่เป็นหรือไง', 'กากแล้วไง ไปยุ่งกับเค้าทำไม', 'ใครกันแน่ที่กาก', 'มั่นใจว่ากาก', 'กากแล้วทำไม', 'พ่อแม่ไม่รักสินะ ถึงว่าคนอื่น', 'กาก แล้วไง', 'มีปัญหาป่ะ', 'กาก ก๊าก กาก', 'กากจริง ๆ', 'เดินไปส่องกระจกสิ จะเจอกากกว่า', 'กาก', 'กอ อา กอ กาก', 'ขอบคุณ');
			$outputttt = $arrayyyy[array_rand($arrayyyy,1)];
			
			if(strstr($text,'กาก')){
			$messages = [
				'type' => 'text',
				'text' => $outputttt
			];}
			
			if($text == '...'){
				$messages = [
				'type' => 'text',
				'text' => จุดจุดจุด
			];}		
			
			if(strstr($text,'กลุ่มอะไร')){
				$messages = [
				'type' => 'text',
				'text' => กลุ่มส่งใบโคลเวอร์เกมเศรษฐีครับ
			];}	
				
			if(strstr($text,'ห้องอะไร')){
				$messages = [
				'type' => 'text',
				'text' => ห้องส่งใบโคลเวอร์เกมเศรษฐีครับ
			];}	
			
			$arrayyy = array('ฝันดีครับ', 'ฝันดีค่ะ', 'นอนหลับฝันดีนะ', 'Sweet dreams.', 'Good Night', 'GN', 'ฝันดีผีกัดตูด', 'ราตรีสวัสดิ์', 'นอนหลับฝันดี ฝันถึงเราด้วยนะ');
			$outputtt = $arrayyy[array_rand($arrayyy,1)];
		
			if($text == 'ราตรีสวัสดิ์' || $text == 'ง่วงล่ะ' || $text == 'ง่วงแล้ว' || $text == 'นอนกันเถอะ' || $text == 'นอนก่อนนะ' || $text == 'ขอตัวนอนก่อนนะ' || $text == 'ขอตัวนอนก่อน' || $text == 'นอนกันดีกว่า' || $text == 'นอนดีกว่า' || $text == 'พรุ่งนี้ตื่นเช้า' || $text == 'ฝันดีครับ' || $text == 'ฝันดีคับ' || $text == 'ฝันดีค่ะ' || $text == 'นอนหลับฝันดี' || $text == 'นอนแล้วนะ' || $text == 'นอนดีกว่า' || $text == 'นอนก่อนนะ' || $text == 'ขอตัวนอนก่อนนะ' || $text == 'ฝันดีทุกคน' || $text == 'ฝันดี ทุกคน' || $text == 'นอนแล้วครับ' || $text == 'นอนแล้วคับ'){
				$messages = [
				'type' => 'text',
				'text' => $outputtt
			];}	
			
			if(strstr($text,'ฝรรดี')){
				$messages = [
				'type' => 'text',
				'text' => $outputtt
			];}
			
			if(strstr($text,'ฝันดี')){
				$messages = [
				'type' => 'text',
				'text' => $outputtt
			];}
			
			$arrayy = array('สวัสดีครับ', 'สวัสดีค่ะ', 'ดีครับ', 'ดีค่ะ', 'ดีคับ', 'หวัดดีคับ', 'หวัดดีครับ', 'หวัดดีค่ะ');
			$outputt = $arrayy[array_rand($arrayy,1)];
		
			if($text == 'สวัสดีทุกคนคับ' || $text == 'สวัสดีทุกคนค่ะ' || $text == 'สวัสดีทุกคนครับ' || $text == 'สวัสดีค่ะทุกคน' || $text == 'สวัสดีคับทุกคน' || $text == 'สวัสดีครับทุกคน' || $text == 'สวัสดีทุกคน' || $text == 'สวัสดี' || $text == 'สวัสดีครับ' || $text == 'ดีครับ' || $text == 'ดีคับ' || $text == 'สวัสดีค่ะ' || $text == 'ดีค่ะ' || $text == 'หวัดดีคับ' || $text == 'หวัดดีครับ' || $text == 'หวัดดีค่ะ'){
				$messages = [
				'type' => 'text',
				'text' => $outputt
			];}	
			
			$arraymorning = array('วัวไม่ขยับครับ', 'วัวไม่ขยับค่ะ', 'มอนิ่งครับ', 'มอนิ่งค่ะ', 'Good morning');
			$outputmorning = $arraymorning[array_rand($arraymorning,1)];
			
			if(strstr($text,'มอนิ่ง')){
				$messages = [
				'type' => 'text',
				'text' => $outputmorning
			];}
			
			if(strstr($text,'วัวไม่ขยับ')){
				$messages = [
				'type' => 'text',
				'text' => มอนิ่งครับ
			];}
					
			$arrayba = array('ก็บ้า เพราะคุยกับคุณนั่นแหละ', 'ก็บ้าเหมือนกันนั่นแหละ คนอะไรคุยกับบอท', 'ศรีธัญญาไปทางไหน ไปด้วยกันไหม', 'ฉีดยาแล้ว ไม่บ้าหรอก ว่าแต่คุณฉีดหรือยัง ?');
			$outputba = $arrayba[array_rand($arrayba,1)];
			
			if(strstr($text,'บอทบ้า')){
				$messages = [
				'type' => 'text',
				'text' => $outputba
			];}
			
			if($text == 'NaN'){
				$messages = [
				'type' => 'text',
				'text' => ".\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\t\n\n\t\n\t\n\t\n\t\n\t\n."
			];}	
				
			if($text == 'RUN'){
				$messages = [
				'type' => 'text',
				'text' => "09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.09.0"
			];}	

			if(strstr($text,'กฎเทส')){
				$messages = [
				'type' => 'text',
				'text' => "กฎในการทดสอบก่อนเข้าแคลน (ปรับปรุง 08/03/60) \n\t\n1. ไม่อยู่ในสังกัดของแคลนใด ๆ ขณะทำการทดสอบ หากทราบจะทำการแบนทันที \n\t\n2. จะต้องมีการ์ดตัวละคร S+ LV. 30 คุมเต๋า 83 ขึ้นไป และมีจี้ที่จำเป็นสำหรับสายวิคเตอรี่และสายล้มละลาย เทียบเท่า S+ LV. 7 ขึ้นไป พร้อมความสามารถพิเศษของจี้เครื่องราง S+ ที่เหมาะสม (อาจมีการเปลี่ยนแปลงตามความเหมาะสม ขึ้นอยู่กับผู้ทำทดสอบ) ถ้าจี้ S+ LV. 7 ยังไม่ครบ 4 ชิ้นขึ้นไป จะยังไม่ส่งลงแข่งในรายการต่าง ๆ \n\t\n3. จะทำการทดสอบด้วยแผนที่ 'ประเทศไทย' 2 ครั้ง  โดยจะเป็นการทดสอบแบบเดี่ยว 1 ครั้ง และแบบทีม 1 ครั้ง ต้องชนะอย่างน้อย 1 ครั้ง จึงจะสามารถผ่านเข้าแคลนได้ อนุโลมได้ถ้าผู้ทำการทดสอบเห็นว่ามีศักยภาพมากพอในการเข้าร่วมกับแคลนได้ \n\t\n* การทดสอบแบบทีมให้ผู้ที่มาขอเข้าทดสอบเล่นคู่กับผู้ทำการทดสอบ แล้วไปสุ่มหาคู่แข่งในห้อง 10 M \n* การทดสอบอาจมีการเปลี่ยนแปลงตามความเหมาะสม ขึ้นอยู่กับผู้ทำการทดสอบ \n\t\n4. หากทดสอบแล้ว 'ผ่าน' ให้ผู้มาขอเข้าทดสอบเปลี่ยนชื่อในไลน์เป็น (OMG)-ชื่อ-ตัวเลข ส่วนในเกมให้เปลี่ยนเป็น (OMG)-ตัวเลข เช่น ชื่อในไลน์เป็น (OMG)-ABC-00 ในเกมส์จะเป็น (OMG)-00 ชื่อในเกมสามารถเปลี่ยนทีหลังได้ หากไม่มีเพชรเปลี่ยน แต่ต้องเปลี่ยนภายใน 24 ชม. หลังจากทราบว่า 'ผ่าน' แล้ว  \n\t\n*ตัวเลขที่ต้องใส่ผู้ทำการทดสอบจะเป็นคนแจ้งให้ทราบ \n\t\n5. เมื่อดึงเข้าแคลนแล้ว ให้แนะนำตัว (ชื่อ อายุ) และอ่านโน๊ตทุกโน๊ตที่ถูกโพสต์ในหน้าโน๊ตของห้องแคลน \n\t\n6. ต้องมีเวลาว่างช่วงเวลา 17.00 - 22.30 น. ตรงต่อเวลา และเข้ามาคุยในแคลนเป็นประจำ \n\t\n7. ปฏิบัติตามกฎของแคลนได้ทุกข้อ สามารถอ่านได้ที่โน๊ตของกลุ่ม \n\t\n*** ไม่สะดวกข้อไหนกรุณาแจ้งล่วงหน้า มิฉะนั้นหากเข้าแคลนแล้ว อาจโดนให้ออกจากแคลน โดยไม่แจ้งให้ทราบล่วงหน้า "
			];}
			
			if(strstr($text,'กฎแคลน')){
				$messages = [
				'type' => 'text',
				'text' => "กฎระเบียบแคลน (ปรับปรุง 08/03/60) \n\t\n1. เคารพการตัดสินใจของ LD Co-LD Elder REF และ SPV ทุกกรณี \n\t\n2. เคารพรุ่นพี่ให้เกียรติรุ่นน้อง พูดคุยกันได้ทุกเรื่อง ไม่จำเป็นต้องเป็นเรื่องเกม งดถ้อยคำหยาบคาย ส่อลามกอานาจาร ส่อเสียด อวดอ้าง อวดเก่ง โชว์พาว ลามปามกับเพื่อนร่วมแคลน \n\t\n3. ไม่ส่งรูปโป๊ (ติดเรทได้ แต่ห้ามโป๊เกินไป) \n\t\n4. ห้ามส่งรูป สิ่งเสพติด ของมึนเมา รวมไปถึงการกล่าวถึงส่วนประกอบ ขั้นตอน หรือวิธีในการผลิต ที่ไม่ใช่ในแง่ของการศึกษาหรืออบรบสั่งสอน \n\t\n5. ห้ามเข้าออกแคลนเอง โดยไม่แจ้ง LD Co-LD Elder REF หรือ SPV หากมีเหตุจำเป็น เช่น เปลี่ยนไอดี ขายไอดี แลกไอดี ให้แจ้ง LD Co-LD Elder REF หรือ SPV ก่อนทุกครั้ง หากออกไปโดยไม่มีเหตุผล จะไม่รับกลับเข้ามาอีกทุกกรณี \n\t\n6. ห้ามสร้างความวุ่นวาย สร้างปัญหา ห้ามทะเลาะกันในแคลน หากมีอะไรไม่พอใจ ให้คุยส่วนตัวหรือแจ้ง LD Co-LD Elder REF หรือ SPV ทันที \n\t\n7. มีเวลาให้แคลนช่วง 17.00 - 22.30 น. เพื่อซ้อมทีมหรือลงแข่งขันในรายการต่าง ๆ \n\t\n8. ถ้าไม่จำเป็น ไม่ควรส่งอีโม (โดยเฉพาะแลบลิ้น) หรือจิ้มเมือง ในการเล่นทั่วไป \n\t\n9. หากมีการแข่งรายการต่าง ๆ งดอีโมทุกชนิดและงดจิ้มเมืองทุกกรณี \n\t\n10. หากมีการให้ลงชื่อในโน๊ต เพื่อตรวจสอบว่าสะดวกหรือไม่สะดวกลงแข่ง แล้ว 'ไม่ลงชื่อ' หรือลงชื่อแต่ 'ไม่ว่าง' ติดต่อกัน เกิน 3 ครั้ง จะพ้นสภาพการเป็นสมาชิกของแคลนทันที (หากมีเหตุจำเป็น จะพิจารณาอนุญาตให้เป็นกรณีไป) และหากมีรายชื่อลงแข่งไม่ว่ารายการใด ๆ แล้วไม่มาแข่ง หรือ ไม่มีการแจ้ง LD Co-LD Elder REF หรือ SPV ล่วงหน้า ก่อนเวลา 18.00 น. ของวันแข่ง จะพ้นสภาพการเป็นสมาชิกของแคลนทันที (หากมีเหตุจำเป็น จะพิจารณาอนุญาตให้เป็นกรณีไป)"
			];}
			
			if(strstr($text,'รูปแบบชื่อ')){
				$messages = [
				'type' => 'text',
				'text' => "รูปแบบชื่อ \n\t\nในไลน์ (OMG)-ชื่อ-เลขที่ได้รับจากผู้ทำการทดสอบ \nในเกม (OMG)-เลขที่ได้รับจากผู้ทำการทดสอบ \n\t\nตัวอย่าง \n\t\n(OMG)-Oh My God-999 => ชื่อในไลน์ \n(OMG)-999 => ชื่อในเกม* \n\t\n*ชื่อในเกม ไม่ต้องใช่ชื่อ ให้ใส่เฉพาะตัวเลขเท่านั้น \n"
			];}
			
			if(strstr($text,'เปลี่ยนชื่อตามนี้')){
				$messages = [
				'type' => 'text',
				'text' => "รูปแบบชื่อ \n\t\nในไลน์ (OMG)-ชื่อ-เลขที่ได้รับจากผู้ทำการทดสอบ \nในเกม (OMG)-เลขที่ได้รับจากผู้ทำการทดสอบ \n\t\nตัวอย่าง \n\t\n(OMG)-Oh My God-999 => ชื่อในไลน์ \n(OMG)-999 => ชื่อในเกม* \n\t\n*ชื่อในเกม ไม่ต้องใช่ชื่อ ให้ใส่เฉพาะตัวเลขเท่านั้น \n"
			];}
			
			if($text == 'ฟอร์มชื่อ'){
				$messages = [
				'type' => 'text',
				'text' => "ในไลน์ (OMG)-ชื่อ- \nในเกม (OMG)-"
			];}
			
			if($text == 'ลิงค์ห้องเทส'){
				$messages = [
				'type' => 'text',
				'text' => "http://line.me/R/ti/g/D83VWOfn6l"
			];}
			
			if($text == 'ลิงค์ห้องเฟรนลี่'){
				$messages = [
				'type' => 'text',
				'text' => "http://line.me/R/ti/g/-yjVBttpYf"
			];}
			
			if($text == 'เปิดลิงค์'){
				$messages = [
				'type' => 'text',
				'text' => "!enableurl"
			];}
			
			if($text == 'ปิดลิงค์'){
				$messages = [
				'type' => 'text',
				'text' => "!preventurl"
			];}
			
			if(strstr($text,'หาแคลน')){
				$messages = [
				'type' => 'text',
				'text' => "[ขออนุญาตแอดมินครับ]\n\t\n(OMG) -Oh My God- CLAN\n\t\nเปิดรับสมัครนักแข่ง\n\t\nเพื่อลงแข่งขันในรายการต่าง ๆ\n\t\nคุณสมบัติของนักแข่ง\n1. การ์ด S+ LV. 30 การควมคุมลูกเต๋า 83 ขี้นไป\n2. จี้เครื่องราง S+ LV. 7 พร้อมความสามารถพิเศษของจี้เครื่องราง S+ ที่เหมาะสม ครบเซ็ต ทั้งสายวิคเตอรี่ และ สายล้มละลาย\n3. มีเวลาให้แคลน ช่วงเวลา 16.00 - 22.00 น. [เน้น ว่าง ช่วงเวลา 20.30 - 21.20 น.]\n4. มีประสบการณ์แข่ง สายแพลตินัม หรือ มาเป็นคู่ จะพิจารณาเป็นพิเศษ \n5. เคารพกฎของแคลน [เน้น ความรับผิดชอบ ตรงต่อเวลา]\n6. ไม่จำกัดอายุ [เน้น คุยรู้เรื่อง]\n\t\nท่านที่สนใจแอดไอดีไลน์มาได้ที่\nning.nhong\n[http://line.me/ti/p/~ning.nhong]\n\t\nแอดมาแล้ว อย่าลืมทักมานะครับ ^ ^\n\t\n___________•••••••••___________\n\t\nLine Official Account : @uha2846w\n[http://line.me/ti/p/~@uha2846w]"
			];}
			
			if(strstr($text,'เข้าแคลน')){
				$messages = [
				'type' => 'text',
				'text' => "[ขออนุญาตแอดมินครับ]\n\t\n(OMG) -Oh My God- CLAN\n\t\nเปิดรับสมัครนักแข่ง\n\t\nเพื่อลงแข่งขันในรายการต่าง ๆ\n\t\nคุณสมบัติของนักแข่ง\n1. การ์ด S+ LV. 30 การควมคุมลูกเต๋า 83 ขี้นไป\n2. จี้เครื่องราง S+ LV. 7 พร้อมความสามารถพิเศษของจี้เครื่องราง S+ ที่เหมาะสม ครบเซ็ต ทั้งสายวิคเตอรี่ และ สายล้มละลาย\n3. มีเวลาให้แคลน ช่วงเวลา 16.00 - 22.00 น. [เน้น ว่าง ช่วงเวลา 20.30 - 21.20 น.]\n4. มีประสบการณ์แข่ง สายแพลตินัม หรือ มาเป็นคู่ จะพิจารณาเป็นพิเศษ \n5. เคารพกฎของแคลน [เน้น ความรับผิดชอบ ตรงต่อเวลา]\n6. ไม่จำกัดอายุ [เน้น คุยรู้เรื่อง]\n\t\nท่านที่สนใจแอดไอดีไลน์มาได้ที่\nning.nhong\n[http://line.me/ti/p/~ning.nhong]\n\t\nแอดมาแล้ว อย่าลืมทักมานะครับ ^ ^\n\t\n___________•••••••••___________\n\t\nLine Official Account : @uha2846w\n[http://line.me/ti/p/~@uha2846w]"
			];}
			
			if(strstr($text,'อยากมีแคลน')){
				$messages = [
				'type' => 'text',
				'text' => "[ขออนุญาตแอดมินครับ]\n\t\n(OMG) -Oh My God- CLAN\n\t\nเปิดรับสมัครนักแข่ง\n\t\nเพื่อลงแข่งขันในรายการต่าง ๆ\n\t\nคุณสมบัติของนักแข่ง\n1. การ์ด S+ LV. 30 การควมคุมลูกเต๋า 83 ขี้นไป\n2. จี้เครื่องราง S+ LV. 7 พร้อมความสามารถพิเศษของจี้เครื่องราง S+ ที่เหมาะสม ครบเซ็ต ทั้งสายวิคเตอรี่ และ สายล้มละลาย\n3. มีเวลาให้แคลน ช่วงเวลา 16.00 - 22.00 น. [เน้น ว่าง ช่วงเวลา 20.30 - 21.20 น.]\n4. มีประสบการณ์แข่ง สายแพลตินัม หรือ มาเป็นคู่ จะพิจารณาเป็นพิเศษ \n5. เคารพกฎของแคลน [เน้น ความรับผิดชอบ ตรงต่อเวลา]\n6. ไม่จำกัดอายุ [เน้น คุยรู้เรื่อง]\n\t\nท่านที่สนใจแอดไอดีไลน์มาได้ที่\nning.nhong\n[http://line.me/ti/p/~ning.nhong]\n\t\nแอดมาแล้ว อย่าลืมทักมานะครับ ^ ^\n\t\n___________•••••••••___________\n\t\nLine Official Account : @uha2846w\n[http://line.me/ti/p/~@uha2846w]"
			];}
			
			if(strstr($text,'มีแคลนไหนรับ')){
				$messages = [
				'type' => 'text',
				'text' => "[ขออนุญาตแอดมินครับ]\n\t\n(OMG) -Oh My God- CLAN\n\t\nเปิดรับสมัครนักแข่ง\n\t\nเพื่อลงแข่งขันในรายการต่าง ๆ\n\t\nคุณสมบัติของนักแข่ง\n1. การ์ด S+ LV. 30 การควมคุมลูกเต๋า 83 ขี้นไป\n2. จี้เครื่องราง S+ LV. 7 พร้อมความสามารถพิเศษของจี้เครื่องราง S+ ที่เหมาะสม ครบเซ็ต ทั้งสายวิคเตอรี่ และ สายล้มละลาย\n3. มีเวลาให้แคลน ช่วงเวลา 16.00 - 22.00 น. [เน้น ว่าง ช่วงเวลา 20.30 - 21.20 น.]\n4. มีประสบการณ์แข่ง สายแพลตินัม หรือ มาเป็นคู่ จะพิจารณาเป็นพิเศษ \n5. เคารพกฎของแคลน [เน้น ความรับผิดชอบ ตรงต่อเวลา]\n6. ไม่จำกัดอายุ [เน้น คุยรู้เรื่อง]\n\t\nท่านที่สนใจแอดไอดีไลน์มาได้ที่\nning.nhong\n[http://line.me/ti/p/~ning.nhong]\n\t\nแอดมาแล้ว อย่าลืมทักมานะครับ ^ ^\n\t\n___________•••••••••___________\n\t\nLine Official Account : @uha2846w\n[http://line.me/ti/p/~@uha2846w]"
			];}
						
			if(strstr($text,'กฎห้องเฟรนลี่')){
			$messages = [
			'type' => 'text',
			'text' => "(OMG)-Friendly Room- \n\t\nกลุ่มนี้สร้างขึ้นเพื่อพูดคุย หารือ ปรึกษา หากระชับมิตร หาเพื่อนเล่น หาสมาชิกแคลน หรือแลกเปลี่ยนประสบการณ์ในกลุ่มผู้เล่นเกมเศรษฐี ดังนั้นไม่จำเป็นต้องพูดคุยแต่เฉพาะในเรื่องเกมเศรษฐีเท่านั้น สามารถพูดคุยได้ทุกเรื่อง ตราบเท่าที่ไม่ผิดกฎ กติกา มารยาท ในการอยู่ร่วมกันด้านล่างนี้ \n\t\nกฎ กติกา มารยาท ในการอยู่ร่วมกันในห้อง (OMG)-Friendly Room- \n\t\n1. ห้ามพูดคุย ถกเถียง เกี่ยวกับสถาบัน ชาติ ศาสนา พระมหากษัตริย์ และการเมือง \n\t\n2. กรุณางดส่งรูป หรือคลิปลามกอนาจาร รูปสิ่งเสพติดหรือของมึนเมาทุกชนิด รวมไปถึงข้อความลูกโซ่ เพจลูกโซ่ หรือข้อความหลอกลวงทุกชนิด \n\t\n3. งดการพูดเชิงดูถูก เสียดสี ถากถาง เยาะเย้ย เหยียดหยาม ส่อเสียด เหน็บแนม ดูหมิ่น ลามปาม อวดอ้าง อวดเก่ง โชว์พาวเวอร์ หรือใช้ถ้อยคำหยาบคาย ต่อบุคคลอื่น \n\t\n4. สำหรับบุคคลที่มีปัญหากันมา กรุณาไปทะเลาะกันส่วนตัว ห้ามมาทะเลาะเบาะแว้ง ก่อดราม่า ก่อความวุ่นวายในห้องนี้ \n\t\n5. ห้ามเพิ่มหรือลบสมาชิกออกจากกลุ่ม ก่อนได้รับอนุญาต ถ้าไม่สามารถเพิ่มสมาชิกได้ให้ส่งข้อมูลผู้ติดต่อ (contact) ทิ้งไว้ แล้วผู้ดูแลห้องจะทำการดึงให้ในภายหลัง \n\t\nหากมีการกระทำผิดดังกล่างข้างต้นหรือการกระทำผิดอื่นใดนอกเหนือจากที่ได้กล่าวไว้ให้อยู่ในดุลพินิจของผู้ดูแลห้องนี้ โดยการลงโทษจะมีตั้งแต่ตักเตือน เตะออกจากห้องไปสงบสติอารมณ์ หรือติดแบล็คลิสต์ ซึ่งขึ้นอยู่กับแต่ละสถานการณ์และดุลพินิจของผู้ดูแลห้อง \n\t\nPowered by (OMG) -Oh My God- CLAN"
			];}
			
			if($text == 'คำสั่งบอท'){
				$messages = [
				'type' => 'text',
				'text' => "คำสั่งที่ใช้ได้ภายในกลุ่ม しりちゃんv10 \n--- \n設定:確認 ：ตรวจสอบการตั้งค่า \n--- \n設定:招待拒否:オン ：ไม่อนุญาตการเชิญคนเข้ากลุ่ม \n設定:招待拒否:オフ : อนุญาตการเชิญคนเข้ากลุ่ม \n設定:グループ名ロック:オン ：ไม่อนุญาตให้เปลี่ยนชื่อกลุ่ม \n設定:グループ名ロック:オフ ：อนุญาตให้เปลี่ยนชื่อกลุ่ม \n設定:アイコンロック:オン ：ไม่อนุญาตให้เปลี่ยนรูปปกของกลุ่ม \n設定:アイコンロック:オフ ：อนุญาตให้เปลี่ยนรูปปกของกลุ่ม \n設定:らっこさん:オン ：เปิด Rakko v10 \n設定:らっこさん:オフ ：ปิด Rakko v10 \n設定:スタンプ規制:オン ：เปิดห้ามส่งสติ๊กเกอร์ติดต่อกัน 15 สติ๊กเกอร์ ใน 1 นาที \n設定:スタンプ規制オフ ：ปิดห้ามส่งสติ๊กเกอร์ติดต่อกัน 15 สติ๊กเกอร์ ใน 1 นาที \n--- \n設定:作成者ロック:オン ：ไม่อนุญาตให้ลบผู้ดูแลหลัก \n設定:作成者ロック:オフ ：อนุญาตให้ลบผู้ดูแลหลัก \n設定:グル作者変更 ：เปลี่ยนผู้ดูแลหลัก \n設定:作者交換 ：ให้ผู้ดูแลสำรองมาเป็นผู้ดูแลหลัก \n設定:予備作者変更 ：เปลี่ยนผู้ดูแลสำรอง \n設定:予備作者削除 ：ลบผู้แลสำรอง \n--- \n設定:ホワイト追加 ：เพิ่มบัญชีขาว \n設定:ブラック追加 ：เพิ่มบัญชีดำ \n設定:リスト削除 ：ลบจากบัญชีดำและบัญชีขาว \n設定:独自リスト削除 ：ล้างบัญชีดำและบัญชีขาว \n設定:独自リストコピー ：คัดลอกบัญชีดำและบัญชีขาวไปใช้กับกลุ่มตัวเอง \n設定:独自リスト共有 ：นำบัญชีขาวและบัญชีดำไปใช้กับกลุ่มของคนอื่น \n設定:リスト確認 ：ยืนยันการนำไปใช้ \n--- \nコピー ：สำเนา \n上書き ：แทนที่ \n--- \nSiri:グル作成者 ：ผู้ดูแลหลัก \nSiri:予備作成者 ：ผู้ดูแลสำรอง \n--- \nSiri:バックアップ ：สำรองข้อมูล \nSiri:ログイン ：ดูข้อมูลที่สำรองไว้ เพื่อเรียกคืน \n--- \nSiri:オフ  ：ปิดการโต้ตอบ \nSiri:オン  ：เปิดการโต้ตอบ คำที่จะโต้ตอบ เช่น おはよう   眠い \n--- \n既読ポイント設定  ：ตั้งค่าเริ่มบันทึกคนอ่าน \n既読確認 ：ดูคนอ่านนับจากที่ตั้งค่าเริ่มบันทึกไว้ \n--- \nSiri:招待キャンセル：ยกเลิกการเชิญเข้ากลุ่มที่ค้างอยู่ ส่ง 2 ครั้ง \n--- \nSiri:招待URL拒否 : ไม่อนุญาตการเชิญโดยใช้ URL \nSiri:招待URL生成 : อนุญาตการเชิญโดยใช้ URL \n--- \nSiri:招待回数 : ดูจำนวนตั๋วเชิญที่เหลือ \nSiri:追加アカウント購入：ซื้อบัญชีเสริมเพิ่ม \nSiri:隠しコマンド : คำสั่งที่ซ่อนอยู่ \n--- \nSiri:絵の作者：บัญชีผู้เขียน Siri \nSiri:作者 : ข้อมูลติดต่อผู้เขียน Siri \n--- \nSiri:バージョン：รุ่นของ siri \nSiri:ヘルプ : ข่วยเหลือ \n--- \n設定:ヘルプ : คำสั่งพื้นฐานที่ใช้ภายในกลุ่ม \n--- \nsiri:optionalAccount : บัญชีเสริม \n--- \nsiri:forcerelease : บังคับเปลี่ยนผู้ดูแลหลัก \n"
			];}
			
			$arraygag = array('กาก เขาพิมพ์กันแบบนี้จ๊ะ ถ้าจะกาก กรุุณากากอย่างมีรสนิยมนะจ๊ะ', 'กาก เขาพิมพ์กันแบบนี้จ๊ะ ถ้าจะกาก กรุุณากากอย่างมีสติด้วยนะจ๊ะ', 'กาก ไม่ใช่ กๅก', 'โปรดใช้สติขณะพิมพ์ด้วยจ๊ะ');
			$outputgag = $arraygag[array_rand($arraygag,1)];
			
			if(strstr($text,'กๅก')){
			$messages = [
				'type' => 'text',
				'text' => $outputgag
			];}
			
			//$arrayb = array('พ่อง !!!', 'พ่องตาย !!!', 'พ่องมรึงตาย !!!' ,'บ่', 'บิดาคุณตาย !!!');
			//$outputb = $arrayb[array_rand($arrayb,1)];
			
			//if($text == 'บ่'){
			//$messages = [
			//	'type' => 'text',
			//	'text' => $outputb
			//];}
							
			//if(strstr($text,'')){
			//	$messages = [
			//	'type' => 'text',
			//	'text' => ""
			//];}
			
			//if(strstr($text,'Set the lastseens')){
			//	$messages = [
			//	'type' => 'sticker',
			//	'STKID' => '100',
			//	'STKPKGID' => '1',
			//	'STKVER' => '100'
			//];}
			
			//else{$messages = [
			//'type' => 'text',
			//'text' => $text}
			
			if($text == 'วิธีใช้'){
				$messages = [
				'type' => 'text',
				'text' => "พื้นฐาน~[วิธีใช้งาน]\nจะช่วย อธิบายคำสั่ง Siri และข้อแนะนำไม่ยุ่งยาก \nใช้งานสะดวกไม่มีกำหนดหมดอายุ\n<ความต้องการ>____<พิมพ์>\n※<เปิดให้สิริตอบคำสั่ง>____<เปิดบอท>\n※<ปิดให้siriไม่ชอบคำสั่ง>____<ปิดบอท>\n※<เชคดูแอดมินห้อง>____<เชคแอดมิน>\n※<เชคดูแอดสำรอง>____<เชคแอดสำรอง>\n※<ดูตั้งค่าในกลุ่มทั้งหมด>____<เชคตั้งค่า>\n※<ดูเวอร์ชั่นรุ่นบอทSiri>____<เชครุ่นบอท>\n※<ตั้งค่าเริ่มตั่นการอ่าน>____<ตั้งเวลา>\n※<ตรวจดูคนอ่าน>____<ใครแอบ>\n※<หากบอทไม่ครบชุดเรียกกลับ>____<เรียกบอทกลับ>\n※<รับคำสั่งสิริ>____<ขอคำสั่งสิริ>\n※<กรณีแอดมินลบบัญชี>____<อัปเดตแอดมิน>\n※<รับคำสั่งโดยตรงจากSiri>____<ช่วยเหลือ>\n_____________•••••••_________ \nอ้างอิงคำสั่งมาจาก ☆ธ ปท Fire✿bird❀bot✍ \nของ http://line.me/R/ti/p/~4G2017"
			];}
			
			if($text == 'เปิดบอท'){
				$messages = [
				'type' => 'text',
				'text' => "Siri:オン"
			];}
			
			if($text == 'ปิดบอท'){
				$messages = [
				'type' => 'text',
				'text' => "Siri:オフ"
			];}	
			
			if($text == 'เชคแอดมิน'){
				$messages = [
				'type' => 'text',
				'text' => "Siri:グル作成者"
			];}	
			
			if($text == 'เชคแอดสำรอง'){
				$messages = [
				'type' => 'text',
				'text' => "Siri:予備作成者"
			];}	
			
			if($text == 'เชคตั้งค่า'){
				$messages = [
				'type' => 'text',
				'text' => "設定:確認"
			];}

			if($text == 'เชครุ่นบอท'){
				$messages = [
				'type' => 'text',
				'text' => "Siri:バージョン"
			];}			
			
			if($text == 'ตั้งเวลา'){
				$messages = [
				'type' => 'text',
				'text' => "既読ポイント設定"
			];}
			
			if(strstr($text,'ใครแอบ')){
				$messages = [
				'type' => 'text',
				'text' => "既読確認"
			];}

			if(strstr($text,'ใครอ่าน')){
				$messages = [
				'type' => 'text',
				'text' => "既読確認"
			];}
			
			if(strstr($text,'のユーザが既読ポイントまで内容を読んでいます')){
				sleep(3);
				$messages = [
				'type' => 'text',
				'text' => "既読ポイント設定"
			];}
			
			if($text == 'เรียกบอทกลับ'){
				$messages = [
				'type' => 'text',
				'text' => "Siri:reinvite"
			];}
			
			if($text == 'ช่วยเหลือ'){
				$messages = [
				'type' => 'text',
				'text' => "Siri:ヘルプ"
			];}
			
			if($text == 'อัปเดตแอดมิน'){
				$messages = [
				'type' => 'text',
				'text' => "Siri:強制解除"
			];}
			
			if($text == 'ขอคำสั่งสิริ'){
				$messages = [
				'type' => 'text',
				'text' => "อืม !!  คำสั่งสิริแบบไหน ! (^・ω・^ )\n★ต้องการชุดตั้งค่า,หรือเปลี่ยน>พิมพ์→ ชุดตั้งค่า\n★ต้องการชุดปิดอนุญาต,หรือล็อค>พิมพ์→ ชุดล็อค\n☆หากต้องการชุดเปิดอนุญาต>พิมพ์→ ชุดปลดล็อค\n__ _ ___ __ __ __ ___ __ __ __ ___ __ __ __ ____ __☆"
			];}

			if($text == 'ชุดตั้งค่า'){
				$messages = [
				'type' => 'text',
				'text' => "[ชุดตั้งค่า] ตั้งหรือเปลี่ยน,ส่งคำสั่ง+ส่งข้อมูลในเวลาเดียวกัน \n★เชคแอดมิน← Siri:groupcreator \n★เชคแอดสำรอง← Siri:予備作成者 \n☆เปลี่ยนแอดมิน← Set:changeowner \n☆ตั้งแอดสำรอง← 設定:予備作者変更 \n________________________________________ \n■ตั้งบัญชีดำ← Set:addblacklist \n□ตั้งบัญชีขาว← Set:addwhitelist \n◆ขับไล่บัญชีดำในกลุ่ม← Siri:追い出し \n________________________________________ \n•ลบค้างเชิญสมาชิกทั้งหมด← Siri:cancelinvite \n•อัปเดตแอดมิน← Siri:強制解除 \n•สลับแอดสำรองเป็นแอดหลัก← 設定:作者交換 \n________________________________________ \nอ้างอิงคำสั่งมาจาก ☆ธ ปท Fire✿bird❀bot✍ \nของ http://line.me/R/ti/p/~4G2017"
			];}

			if($text == 'ชุดล็อค'){
				$messages = [
				'type' => 'text',
				'text' => "[ชุดล็อค] ปิดอนุญาตสมาชิก☆ \n1>ล็อคไอคอน← Set:iconlock:on \n2>ปิดอนุญาตเชิญ← Set:blockinvite:on \n3>ล็อคแอดมิน← Set:ownerlock:on \n4>ล็อคชื่อกลุ่ม← Set:changenamelock:on \n5>ล็อคสติ๊กเกอร์← Set:StampLimitation:On \n6>ล็อคบอทอ่านไม่ให้ตอบ← 設定:らっこさん:off \n7>ล็อค,ปิดลิงค์กลุ่ม← Siri:DenyURLInvite \n8>ปิดบอทเพื่อไม่ให้ตอบคำสั่ง← siri:off \n__ ____ ___ __ ___ ____ __ __ ___ ____ _ ___☆ \nอ้างอิงคำสั่งมาจาก ☆ธ ปท Fire✿bird❀bot✍ \nของ http://line.me/R/ti/p/~4G2017"
			];}

			if($text == 'ชุดปลดล็อค'){
				$messages = [
				'type' => 'text',
				'text' => "ชุดปลดล็อค] เปิดอนุญาตสมาชิก \n1>ปลดล็อคไอคอน← Set:iconlock:off \n2>เปิดอนุญาตเชิญ← Set:blockinvite:off \n3>ปลดล็อคแอดมิน← Set:ownerlock:off \n4>ปลดล็อคชื่อกลุ่ม← Set:changenamelock:on \n5>ปลดล็อคสติ๊กเกอร์← Set:StampLimitation:On \n6>เปิดใช้งานบอทอ่าน← 設定:らっこさん:on \n7>เปิดลิงค์กลุ่ม← Siri:inviteurl \n8>เปิดบอทเพื่อให้ตอบคำสั่ง← siri:on \n__ ____ ___ __ ___ ____ __ __ ___ ____ __ __ ___ \nอ้างอิงคำสั่งมาจาก ☆ธ ปท Fire✿bird❀bot✍ \nของ http://line.me/R/ti/p/~4G2017"
			];}			
			
			// Make a POST Request to Messaging API to reply to sender
			$url = 'https://api.line.me/v2/bot/message/reply';
			$data = [
				'replyToken' => $replyToken,
				'messages' => [$messages],
			];
			$post = json_encode($data);
			$headers = array('Content-Type: application/json', 'Authorization: Bearer ' . $access_token);

			$ch = curl_init($url);
			curl_setopt($ch, CURLOPT_CUSTOMREQUEST, "POST");
			curl_setopt($ch, CURLOPT_RETURNTRANSFER, true);
			curl_setopt($ch, CURLOPT_POSTFIELDS, $post);
			curl_setopt($ch, CURLOPT_HTTPHEADER, $headers);
			curl_setopt($ch, CURLOPT_FOLLOWLOCATION, 1);
			$result = curl_exec($ch);
			curl_close($ch);

			echo $result . "\r\n";
						
		}
		
		elseif ($event['type'] == 'message' && $event['message']['type'] == 'sticker') {

			// Get replyToken
			$replyToken = $event['replyToken'];
					
			//$sticker = array(
			//'type' => 'sticker',
			//'STKID' => '100',
			//'STKPKGID' => '1',
			//'STKVER' => '100'
			//);
			
			//$stickerarray = array('', '', '', '', '', '', '', '', '','', '', '', '', '', '', '', '', '','', '', '', '', '', '', '', '', '','', '', '', '', '', '', '', '', '','', '', '', '', '', '', '', '', '','', '', '', '', '', '', '', '', '', '', '', '', '', '','', '', '', '', '', '', '', '', '', '', '', '', '', '','', '', '', '', '', '', '', '', '', '', '', '', '', '','อย่าส่งให้เห็นอีกนะ', '', 'อิจฉาคนมีสติ๊กเกอร์ใช้จัง', '', 'มีเงินอย่างเดียวซื้อลายนี้ไม่ด้นะเนี่ย ต้อง... ด้วย', '', 'คิดยังไงถึงซื้อลายนี้', '', 'ตอนโหลดลายนี้ ใช้อะไรคิด', '', 'ลายกาก ๆ แบบนี้ กล้าใช้เนอะ', '', 'สติ๊กเกอร์กาก ๆ', '', 'อย่าให้เห็นว่าส่งอีกนะ', '', 'พิมพ์บ้างก็ดีนะ ', '', 'ขอลายอื่นได้ม่ะ ลายนี้เบื่อแล้ว', '', 'คนบ้าอะไร ส่งแต่สติ๊กเกอร์', '', 'ว๊าย ขี้อวด', '', 'รู้แล้วจ๊ะ ว่ามีสติ๊กเกอร์ใช้', '', 'เพิ่งเคยใช้สติ๊กเกอร์สินะ', '', 'ไปไถสติ๊กเกอร์นี้มาจากไหน ขอพิกัดด่วน !!!', '', 'ลบทิ้งไปเถอะ สติ๊กเกอร์กาก ๆ แบบนี้ เก็บไว้ก็เปลืองความจำเครื่อง', '', 'กลัวใช้ไม่คุ้มหรือไง ส่งอยู่ได้ สติ๊กเกอร์', '', 'เกลียดสติ๊กเกอร์ลายนี้ ขอร้อง อย่าส่งอีกนะ สงสารผมเถอะ', '', 'สติ๊กเกอร์ฟรีหรือเปล่าเนี่ย ถึงส่งได้ส่งดี', '', 'จะอวดไปถึงไหน รู้แล้วจ้า ว่ามีสติ๊กเกอร์ใช้', '', 'ส่งมาบ่อย ๆ ซื้อให้มั่งก็ดีนะ', '', 'อย่าส่งให้เห็นอีกนะ ลบทิ้งไปเลยก็ดี สติ๊กเกอร์ลายกาก ๆ แบบนี้', '', 'จะอวดว่ามีสติ๊กเกอร์ใช้สินะ', '', 'ส่งบ่อย ๆ ไม่ดีนะ เดี๋ยวพี่ しりちゃん v10 เค้าโมโหเอานะ', '', 'ซื้อใหม่บ้างเถอะ สติ๊กเกอร์ลายนี้ คิดว่าใช้คุ้มแล้วนะ เห็นจนเบื่อแล้ว', '', 'พิมพ์บ้างเถอะ อย่าส่งแต่สติ๊กเกอร์เลย จะได้ไม่เป็นภาระของสังคมไลน์', '', 'โทรศัพท์กากรึ ไม่มีแป้นพิมพ์ ถึงกดส่งแต่สติ๊กเกอร์', '', 'เรียนมาน้อยสินะ ถึงพิมพ์ไม่เป็น ส่งแต่สติ๊กเกอร์อยู่ได้', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '');
			//$stickeroutput = $stickerarray[array_rand($stickerarray,1)];
			
			//$sticker = [
			//	'type' => 'text',
			//	'text' => $stickeroutput
			//];
			
			//$sticker = [
			//‘type’ => ‘sticker’,
			//‘packageId’ => ‘4’,
			//‘stickerId’ => ‘300’
			//];
			
			//$sticker = array(
			//‘type’ => ‘sticker’,
			//‘packageId’ => ‘4’,
			//‘stickerId’ => ‘300’
			//);
			
			$packageId = ‘4’;
			$stickerId = '300';
			
			$sticker = array(["type" => "sticker", 
			"packageId" => $packageId, 
			"stickerId" => $stickerId])
			
			// Make a POST Request to Messaging API to reply to sender
			$url = 'https://api.line.me/v2/bot/message/reply';
			$packet = array([
				'replyToken' => $replyToken,
				'messages' => array([$sticker]),
			]);
			
			$post = json_encode($packet);
			$headers = array('Content-Type: application/json', 'Authorization: Bearer ' . $access_token);

			$ch = curl_init($url);
			curl_setopt($ch, CURLOPT_CUSTOMREQUEST, "POST");
			curl_setopt($ch, CURLOPT_RETURNTRANSFER, true);
			curl_setopt($ch, CURLOPT_POSTFIELDS, $post);
			curl_setopt($ch, CURLOPT_HTTPHEADER, $headers);
			curl_setopt($ch, CURLOPT_FOLLOWLOCATION, 1);
			$result = curl_exec($ch);
			curl_close($ch);

			echo $result . "\r\n";
		}
	}
}

echo "OK";